## 數據篩選

In [76]:
import pandas as pd
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, 
                   {'name':'mary',  'gender':'F', 'age':23}, 
                   {'name':'tom',   'gender':'M', 'age':35}, 
                   {'name':'ted',   'gender':'M', 'age':33}, 
                   {'name':'jean',  'gender':'F', 'age':21}, 
                   {'name':'lisa',  'gender':'F', 'age':20}])

In [5]:
#查看df前5行
df.head(5)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [6]:
#利用ix索引查找行号名为1的行记录
df.ix[1]

age         23
gender       F
name      mary
Name: 1, dtype: object

In [8]:
#利用ix查找行号名为1-3的行记录
df.ix[1:3]

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted

In [10]:
#利用列名返回name列数据
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [12]:
#返回name与age列数据
df[['name','age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [55]:
#返回行名号为1、2的name与age列数据
df.ix[1:2,['name','age']]

   name  age
1  mary   23
2   tom   35

In [29]:
?df.ix

In [15]:
#返回gender列数据
df['gender']

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [31]:
df.gender

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [16]:
#判断每行的gender列数据是否为M
df.gender=='M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [18]:
#返回男性的行数据
df[df.gender=='M']

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [19]:
#判断各行记录age列是否大于30
df.age>30

0    False
1    False
2     True
3     True
4    False
5    False
Name: age, dtype: bool

In [20]:
#返回年龄大于30岁的行数据
df[df.age>30]

   age gender name
2   35      M  tom
3   33      M  ted

In [26]:
#返回男性且年龄大于30的行数据
df.ix[(df.gender=='M') & (df.age>30),]

   age gender name
2   35      M  tom
3   33      M  ted

In [27]:
#返回男性或年龄大于30的行数据
df.ix[(df.gender=='M') | (df.age>30),]

   age gender   name
0   29      M  frank
2   35      M    tom
3   33      M    ted

In [34]:
#df增加employee列，其值均为True
df['employee']=True

In [36]:
df.head()#查看df前5行

   age gender   name employee
0   29      M  frank     True
1   23      F   mary     True
2   35      M    tom     True
3   33      M    ted     True
4   21      F   jean     True

In [40]:
#利用del删除employee列
del df['employee']

In [41]:
df.head()#查看df前5行

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [42]:
#再次为df增加employee列
df['employee']=True
df.head()#查看df前5行

   age gender   name employee
0   29      M  frank     True
1   23      F   mary     True
2   35      M    tom     True
3   33      M    ted     True
4   21      F   jean     True

In [49]:
#利用df.drop函数删除employee列，按列删除
df = df.drop('employee',axis=1)

In [50]:
df.head()#查看df前5行

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [51]:
df#查看df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [52]:
#利用loc查看行号名为5的行数据
df.loc[5]

age         20
gender       F
name      lisa
Name: 5, dtype: object

In [66]:
#为df增加行号名为6的行数据，数据为{'age':20, 'gender': 'F', 'name':'qoo'}
df.loc[6]={'age':20, 'gender': 'F', 'name':'qoo'}

In [68]:
df = df.drop(6)#利用df.drop删除索引号为6的记录
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [69]:
#利用df.append增加以上行数据到df中，ignore_index为True
df = df.append(pd.DataFrame([{'age':20, 'gender': 'F', 'name':'qoo'}]), ignore_index=True)

In [70]:
df#查看df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo

In [72]:
#利用df.drop删除索引号为6的行数据
df.drop(6)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [73]:
df#查看df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo

In [77]:
#为df增加一列数据userid，值为101-106,提示：利用range函数
df['userid'] = range(101,107)

In [78]:
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106

In [82]:
#利用set_index设置userid为索引列，代替原来行号名
df = df.set_index('userid')

In [83]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

loc——通过行（行名字）标签索引行数据 
iloc——通过行号（行序号，从0开始）索引行数据 
ix——通过行标签或者行号索引行数据（基于loc和iloc 的混合）

In [86]:

#分别利用行名与行序号返回第一条行数据
df.loc[101]
df.iloc[0]

age          29
gender        M
name      frank
Name: 101, dtype: object

In [91]:
#返回df第2，4，6行的数据
df.iloc[[1,3,5]]
df.loc[[102,104,106]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [93]:
#利用ix返回行名为101,103,105的记录
df.ix[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

In [95]:
#利用loc返回行名为[101,103,105]的记录
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean